// 気象庁天気コードのマップ
export const WEATHER_CODE: {
    [key: string]: string
} = {
    100: '晴',
    101: '晴時々曇',
    102: '晴一時雨',
    103: '晴時々雨',
    104: '晴一時雪',
    105: '晴時々雪',
    106: '晴一時雨か雪',
    107: '晴時々雨か雪',
    108: '晴一時雨か雷雨',
    110: '晴後時々曇',
    111: '晴後曇',
    112: '晴後一時雨',
    113: '晴後時々雨',
    114: '晴後雨',
    115: '晴後一時雪',
    116: '晴後時々雪',
    117: '晴後雪',
    118: '晴後雨か雪',
    119: '晴後雨か雷雨',
    120: '晴朝夕一時雨',
    121: '晴朝の内一時雨',
    122: '晴夕方一時雨',
    123: '晴山沿い雷雨',
    124: '晴山沿い雪',
    125: '晴午後は雷雨',
    126: '晴昼頃から雨',
    127: '晴夕方から雨',
    128: '晴夜は雨',
    130: '朝の内霧後晴',
    131: '晴明け方霧',
    132: '晴朝夕曇',
    140: '晴時々雨で雷を伴う',
    160: '晴一時雪か雨',
    170: '晴時々雪か雨',
    181: '晴後雪か雨',
    200: '曇',
    201: '曇時々晴',
    202: '曇一時雨',
    203: '曇時々雨',
    204: '曇一時雪',
    205: '曇時々雪',
    206: '曇一時雨か雪',
    207: '曇時々雨か雪',
    208: '曇一時雨か雷雨',
    209: '霧',
    210: '曇後時々晴',
    211: '曇後晴',
    212: '曇後一時雨',
    213: '曇後時々雨',
    214: '曇後雨',
    215: '曇後一時雪',
    216: '曇後時々雪',
    217: '曇後雪',
    218: '曇後雨か雪',
    219: '曇後雨か雷雨',
    220: '曇朝夕一時雨',
    221: '曇朝の内一時雨',
    222: '曇夕方一時雨',
    223: '曇日中時々晴',
    224: '曇昼頃から雨',
    225: '曇夕方から雨',
    226: '曇夜は雨',
    228: '曇昼頃から雪',
    229: '曇夕方から雪',
    230: '曇夜は雪',
    231: '曇海上海岸は霧か霧雨',
    240: '曇時々雨で雷を伴う',
    250: '曇時々雪で雷を伴う',
    260: '曇一時雪か雨',
    270: '曇時々雪か雨',
    281: '曇後雪か雨',
    300: '雨',
    301: '雨時々晴',
    302: '雨時々止む',
    303: '雨時々雪',
    304: '雨か雪',
    306: '大雨',
    308: '雨で暴風を伴う',
    309: '雨一時雪',
    311: '雨後晴',
    313: '雨後曇',
    314: '雨後時々雪',
    315: '雨後雪',
    316: '雨か雪後晴',
    317: '雨か雪後曇',
    320: '朝の内雨後晴',
    321: '朝の内雨後曇',
    322: '雨朝晩一時雪',
    323: '雨昼頃から晴',
    324: '雨夕方から晴',
    325: '雨夜は晴',
    326: '雨夕方から雪',
    327: '雨夜は雪',
    328: '雨一時強く降る',
    329: '雨一時みぞれ',
    340: '雪か雨',
    350: '雨で雷を伴う',
    361: '雪か雨後晴',
    371: '雪か雨後曇',
    400: '雪',
    401: '雪時々晴',
    402: '雪時々止む',
    403: '雪時々雨',
    405: '大雪',
    406: '風雪強い',
    407: '暴風雪',
    409: '雪一時雨',
    411: '雪後晴',
    413: '雪後曇',
    414: '雪後雨',
    420: '朝の内雪後晴',
    421: '朝の内雪後曇',
    422: '雪昼頃から雨',
    423: '雪夕方から雨',
    425: '雪一時強く降る',
    426: '雪後みぞれ',
    427: '雪一時みぞれ',
    450: '雪で雷を伴う',
}

export type WeatherCode = typeof WEATHER_CODE[keyof typeof WEATHER_CODE]

// 気象庁エリアコードのマップ
// https://www.jma.go.jp/bosai/common/const/area.json

export const AREA_CODE: {
    name: string
    areaCode: string
}[] = [
    {
        name: '北海道 宗谷',
        areaCode: '011000',
    },
    {
        name: '北海道 上川・留萌',
        areaCode: '012000',
    },
    {
        name: '北海道 網走・北見・紋別',
        areaCode: '013000',
    },
    {
        name: '北海道 十勝',
        areaCode: '014030',
    },
    {
        name: '北海道 釧路・根室',
        areaCode: '014100',
    },
    {
        name: '北海道 胆振・日高',
        areaCode: '015000',
    },
    {
        name: '北海道 石狩・空知・後志',
        areaCode: '016000',
    },
    {
        name: '北海道 渡島・檜山',
        areaCode: '017000',
    },
    {
        name: '青森県',
        areaCode: '020000',
    },
    {
        name: '岩手県',
        areaCode: '030000',
    },
    {
        name: '宮城県',
        areaCode: '040000',
    },
    {
        name: '秋田県',
        areaCode: '050000',
    },
    {
        name: '山形県',
        areaCode: '060000',
    },
    {
        name: '福島県',
        areaCode: '070000',
    },
    {
        name: '茨城県',
        areaCode: '080000',
    },
    {
        name: '栃木県',
        areaCode: '090000',
    },
    {
        name: '群馬県',
        areaCode: '100000',
    },
    {
        name: '埼玉県',
        areaCode: '110000',
    },
    {
        name: '千葉県',
        areaCode: '120000',
    },
    {
        name: '東京都',
        areaCode: '130000',
    },
    {
        name: '神奈川県',
        areaCode: '140000',
    },
    {
        name: '山梨県',
        areaCode: '190000',
    },
    {
        name: '長野県',
        areaCode: '200000',
    },
    {
        name: '岐阜県',
        areaCode: '210000',
    },
    {
        name: '静岡県',
        areaCode: '220000',
    },
    {
        name: '愛知県',
        areaCode: '230000',
    },
    {
        name: '三重県',
        areaCode: '240000',
    },
    {
        name: '新潟県',
        areaCode: '150000',
    },
    {
        name: '富山県',
        areaCode: '160000',
    },
    {
        name: '石川県',
        areaCode: '170000',
    },
    {
        name: '福井県',
        areaCode: '180000',
    },
    {
        name: '滋賀県',
        areaCode: '250000',
    },
    {
        name: '京都府',
        areaCode: '260000',
    },
    {
        name: '大阪府',
        areaCode: '270000',
    },
    {
        name: '兵庫県',
        areaCode: '280000',
    },
    {
        name: '奈良県',
        areaCode: '290000',
    },
    {
        name: '和歌山県',
        areaCode: '300000',
    },
    {
        name: '鳥取県',
        areaCode: '310000',
    },
    {
        name: '島根県',
        areaCode: '320000',
    },
    {
        name: '岡山県',
        areaCode: '330000',
    },
    {
        name: '広島県',
        areaCode: '340000',
    },
    {
        name: '徳島県',
        areaCode: '360000',
    },
    {
        name: '香川県',
        areaCode: '370000',
    },
    {
        name: '愛媛県',
        areaCode: '380000',
    },
    {
        name: '高知県',
        areaCode: '390000',
    },
    {
        name: '山口県',
        areaCode: '350000',
    },
    {
        name: '福岡県',
        areaCode: '400000',
    },
    {
        name: '佐賀県',
        areaCode: '410000',
    },
    {
        name: '長崎県',
        areaCode: '420000',
    },
    {
        name: '熊本県',
        areaCode: '430000',
    },
    {
        name: '大分県',
        areaCode: '440000',
    },
    {
        name: '宮崎県',
        areaCode: '450000',
    },
    {
        name: '鹿児島県',
        areaCode: '460100',
    },
    {
        name: '鹿児島県 奄美',
        areaCode: '460040',
    },
    {
        name: '沖縄県 本島',
        areaCode: '471000',
    },
    {
        name: '沖縄県 大東島',
        areaCode: '472000',
    },
    {
        name: '沖縄県 宮古島',
        areaCode: '473000',
    },
    {
        name: '沖縄県 八重山',
        areaCode: '474000',
    },
]

export type AreaCode = typeof AREA_CODE[number]['areaCode']
